create_clock -period 5 clk0
create_clock -period 6 clk1
# set_input_delay 1 -clock clk [get_ports {*}] 
# set_output_delay 1 -clock clk [get_ports {*}] 
