 
# Yosys synthesis script for filt_ppi
# Read source files
read -vlog2k /nfs_eda_sw/softwares/Raptor/instl_dir/04_02_2023_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/cell_sim_blackbox.v
verific -vlog-incdir ../../rtl ../ /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/bitstream_simulation_new/test/ArchBench/Testcases/filt_ppi/filt_ppi_golden/../rtl 
verific -vlog-libdir ../../rtl 
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k /nfs_scratch/scratch/CompilerValidation/zaheer_ahmad/bitstream_simulation_new/test/ArchBench/Testcases/filt_ppi/filt_ppi_golden/../rtl/filt_ppi.v
verific -import filt_ppi


# Technology mapping
hierarchy -top filt_ppi



plugin -i synth-rs

synth_rs  -tech genesis3 -de     -max_device_dsp 154 -max_device_bram 154      -de_max_threads -1   

write_verilog -noexpr -nodec -v filt_ppi_post_synth.v
write_blif filt_ppi_post_synth.blif

  